dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_sdhc.c
cy_rslt_t cy_sdhc_init(cy_sdhc_t *obj,
                    cy_gpio_t cmd,
                    cy_gpio_t clk,
                    cy_gpio_t data0,
                    cy_gpio_t data1,
                    cy_gpio_t data2,
                    cy_gpio_t data3,
                    cy_gpio_t data4,
                    cy_gpio_t data5,
                    cy_gpio_t data6,
                    cy_gpio_t data7,
                    cy_gpio_t cardDetect,
                    cy_gpio_t ioVoltSel,
                    cy_gpio_t cardIfPwrEn,
                    cy_gpio_t cardMechWriteProt,
                    cy_gpio_t ledCtrl,
                    cy_gpio_t cardEmmcReset)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_en_sd_host_status_t driverRet = CY_SD_HOST_SUCCESS;
    GPIO_PRT_Type *port;
    const uint32_t outputVal = 0UL;
    cy_stc_sd_host_init_config_t   hostConfig;

    /* Enable the SDHC block. */
    Cy_SD_Host_Enable(obj->base);

    /* Configure GPIO pins. */
    port = Cy_GPIO_PortToAddr(CY_PORT(cmd));
    Cy_GPIO_Pin_FastInit(port, CY_PIN(cmd), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);

    port = Cy_GPIO_PortToAddr(CY_PORT(clk));
    Cy_GPIO_Pin_FastInit(port, CY_PIN(clk), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);

    port = Cy_GPIO_PortToAddr(CY_PORT(data0));
    Cy_GPIO_Pin_FastInit(port, CY_PIN(data0), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);

    if (NC != data1)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data1));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data1), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data2)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data2));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data2), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data3)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data3));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data3), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data4)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data4));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data4), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data5)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data5));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data5), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data6)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data6));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data6), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data7)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data7));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data7), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != cardDetect)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(cardDetect));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(cardDetect), CY_GPIO_DM_HIGHZ, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != ioVoltSel)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(ioVoltSel));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(ioVoltSel), CY_GPIO_DM_STRONG_IN_OFF, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != cardIfPwrEn)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(cardIfPwrEn));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(cardIfPwrEn), CY_GPIO_DM_STRONG_IN_OFF, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != cardMechWriteProt)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(cardMechWriteProt));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(cardMechWriteProt), CY_GPIO_DM_HIGHZ, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != ledCtrl)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(ledCtrl));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(ledCtrl), CY_GPIO_DM_STRONG_IN_OFF, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != cardEmmcReset)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(cardEmmcReset));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(cardEmmcReset), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    /* Configure SD Host to operate */
    hostConfig.dmaType = obj->dmaType;
    hostConfig.enableLedControl = obj->enableLedControl;
    hostConfig.emmc = obj->emmc;
    obj->context.cardType = CY_SD_HOST_NOT_EMMC;

    driverRet = Cy_SD_Host_Init(obj->base, &hostConfig, &obj->context);

    if (CY_SD_HOST_SUCCESS != driverRet)
    {
        ret = CY_RSLT_TYPE_ERROR;
    }

    return ret;
}


cy_rslt_t cy_sdhc_free(cy_sdhc_t *obj)
{
    Cy_SD_Host_DeInit(obj->base);

    return CY_RSLT_SUCCESS;
}


cy_rslt_t cy_sdhc_configure(cy_sdhc_t *obj, const cy_sdhc_config_t *config)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_en_sd_host_status_t driverRet = CY_SD_HOST_SUCCESS;
    cy_stc_sd_host_sd_card_config_t stcSdcardCfg;
    cy_en_sd_host_card_capacity_t cardCapacity;
    uint32_t rca = 0UL;
    cy_en_sd_host_card_type_t cardType = CY_SD_HOST_UNUSABLE;
    
    /** Initialize the SDIO/SD/eMMC card configuration structure */
    stcSdcardCfg.lowVoltageSignaling = config->lowVoltageSignaling;
    stcSdcardCfg.busWidth = convert_buswidth(config->busWidth);
    stcSdcardCfg.cardType = &cardType;
    stcSdcardCfg.rca = &rca;
    stcSdcardCfg.cardCapacity = &cardCapacity;
    
    /** Initialize the card */
    driverRet = Cy_SD_Host_InitCard(obj->base, &stcSdcardCfg, &obj->context);
    
    if (CY_SD_HOST_SUCCESS != driverRet)
    {
        ret = CY_RSLT_TYPE_ERROR;
    }

    return ret;
}


cy_rslt_t cy_sdhc_read(const cy_sdhc_t *obj, uint32_t address, uint8_t *data, size_t *length)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_en_sd_host_status_t driverRet;
    cy_stc_sd_host_write_read_config_t dataConfig;

    dataConfig.data = (uint32_t*)data;   /* The pointer to data. */
    dataConfig.address = address;        /* The address to write/read data on the card or eMMC. */
    dataConfig.numberOfBlocks = (uint32_t)*length;  /* The number of blocks to write/read. */
    if (1UL == (uint32_t)*length)
    {
        dataConfig.autoCommand = CY_SD_HOST_AUTO_CMD_NONE;  /* Selects which auto commands are used if any. */
    }
    else
    {
        dataConfig.autoCommand = CY_SD_HOST_AUTO_CMD_AUTO;  /* Selects which auto commands are used if any. */
    }
    dataConfig.dataTimeout = CY_HAL_SDHC_TRANSFER_TIMEOUT;      /* The timeout value for the transfer. */
    dataConfig.enReliableWrite = false; /* For EMMC cards enable reliable write. */
    dataConfig.enableDma = true;

    driverRet = Cy_SD_Host_Read(obj->base, &dataConfig, &obj->context);

