dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_sdhc.c
cy_rslt_t cy_sdio_init(cy_sdio_t *obj, cy_gpio_t cmd, cy_gpio_t clk, cy_gpio_t data0, cy_gpio_t data1, cy_gpio_t data2, cy_gpio_t data3)
{
    cy_stc_sd_host_init_config_t    hostConfig;
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    GPIO_PRT_Type *port;
    const uint32_t outputVal = 0UL;
    cy_stc_sd_host_context_t context;

    /* Enable the SDHC block. */
    Cy_SD_Host_Enable(obj->base);

    /* Configure GPIO pins. */
    port = Cy_GPIO_PortToAddr(CY_PORT(cmd));
    Cy_GPIO_Pin_FastInit(port, CY_PIN(cmd), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);

    port = Cy_GPIO_PortToAddr(CY_PORT(clk));
    Cy_GPIO_Pin_FastInit(port, CY_PIN(clk), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);

    port = Cy_GPIO_PortToAddr(CY_PORT(data0));
    Cy_GPIO_Pin_FastInit(port, CY_PIN(data0), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);

    if (NC != data1)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data1));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data1), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data2)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data2));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data2), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    if (NC != data3)
    {
        port = Cy_GPIO_PortToAddr(CY_PORT(data3));
        Cy_GPIO_Pin_FastInit(port, CY_PIN(data3), CY_GPIO_DM_STRONG, outputVal, HSIOM_SEL_ACT_14);
    }

    hostConfig.dmaType = CY_SD_HOST_DMA_SDMA;
    hostConfig.emmc = false;
    hostConfig.enableLedControl = false;
    context.cardType = CY_SD_HOST_SDIO;

    /* Configure SD Host to operate */
    (void) Cy_SD_Host_Init(obj->base, &hostConfig, &context);

    /*Only enable the Card and SDMA interrupt*/
    Cy_SD_Host_SetNormalInterruptMask(obj->base, (CY_SD_HOST_CARD_INTERRUPT | CY_SD_HOST_DMA_INTERRUPT));

    /*Don't enable any error interrupts for now*/
    Cy_SD_Host_SetErrorInterruptMask(obj->base, 0UL);

    /*Clear all interrupts*/
    Cy_SD_Host_ClearErrorInterruptStatus(obj->base, 0xffff);
    Cy_SD_Host_ClearNormalInterruptStatus(obj->base, 0xffff);

    /*Enable SDHC interrupt*/
    if (SDHC0 == obj->base)
    {
        NVIC_EnableIRQ(sdhc_0_interrupt_general_IRQn);
    }
    else if (SDHC1 == obj->base)
    {
        NVIC_EnableIRQ(sdhc_1_interrupt_general_IRQn);
    }
    else
    {
        ret = CY_RSLT_TYPE_ERROR;
    }

    (void)Cy_SD_Host_SetHostBusWidth(SDHC0, CY_SD_HOST_BUS_WIDTH_4_BIT);

    /* Change the host SD clock to 400 kHz */
    (void)Cy_SD_Host_SdCardChangeClock(SDHC0, CY_SD_HOST_CLK_400K);

    /* Wait for WiFi chip to be ready */
    Cy_SysLib_Delay(1000);

    return ret;
}


cy_rslt_t cy_sdio_free(cy_sdio_t *obj)
{
    Cy_SD_Host_DeInit(obj->base);

    return CY_RSLT_SUCCESS;
}


cy_rslt_t cy_sdio_configure(cy_sdio_t *obj, const cy_sdio_cfg_t *config)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_en_sd_host_status_t result;
    uint32_t               loop_count = 0UL;
    uint32_t               rca = 0UL;
    cy_stc_sd_host_cmd_config_t cmd;

    do
    {
        /* Send CMD0 to set it to idle state */
        cmd.commandIndex                    = (uint32_t)SDIO_CMD_GO_IDLE_STATE;
        cmd.commandArgument                 = (uint32_t)0;
        cmd.enableCrcCheck                  = false;
        cmd.enableAutoResponseErrorCheck    = false;
        cmd.respType                        = CY_SD_HOST_RESPONSE_NONE;
        cmd.enableIdxCheck                  = false;
        cmd.dataPresent                     = false;
        cmd.cmdType                         = CY_SD_HOST_CMD_NORMAL;

        (void)Cy_SD_Host_SendCommand(obj->base, &cmd);
        (void)Cy_SD_Host_PollCmdComplete(obj->base);

        /* CMD5 */
        cmd.commandIndex                    = (uint32_t)SDIO_CMD_IO_SEND_OP_COND;
        cmd.commandArgument                 = (uint32_t)0;
        cmd.enableCrcCheck                  = false;
        cmd.enableAutoResponseErrorCheck    = false;
        cmd.respType                        = CY_SD_HOST_RESPONSE_LEN_48;
        cmd.enableIdxCheck                  = false;
        cmd.dataPresent                     = false;
        cmd.cmdType                         = CY_SD_HOST_CMD_NORMAL;

        (void)Cy_SD_Host_SendCommand(obj->base, &cmd);
        (void)Cy_SD_Host_PollCmdComplete(obj->base);

        /* Send CMD3 to get RCA. */
        cmd.commandIndex                    = (uint32_t)SDIO_CMD_SEND_RELATIVE_ADDR;
        cmd.commandArgument                 = (uint32_t)0;
        cmd.enableCrcCheck                  = true;
        cmd.enableAutoResponseErrorCheck    = false;
        cmd.respType                        = CY_SD_HOST_RESPONSE_LEN_48;
        cmd.enableIdxCheck                  = true;
        cmd.dataPresent                     = false;
        cmd.cmdType                         = CY_SD_HOST_CMD_NORMAL;

        result = Cy_SD_Host_SendCommand(obj->base, &cmd);

        if (CY_SD_HOST_SUCCESS == result)
        {
            result = Cy_SD_Host_PollCmdComplete(obj->base);

            (void)Cy_SD_Host_GetResponse(obj->base, &rca, false);
        }

        loop_count++;
        if ( loop_count >= (uint32_t) SDIO_ENUMERATION_TIMEOUT_MS )
        {
            result = CY_SD_HOST_ERROR_TIMEOUT;
            break;
        }
    } while ( ( CY_SD_HOST_SUCCESS != result ) && ( sdio_delay_milliseconds( (uint32_t) 1 ), ( 1 == 1 ) ) );

    if (CY_SD_HOST_SUCCESS == result)
    {
        /* Send CMD7 with the returned RCA to select the card */
        cmd.commandIndex                    = (uint32_t)SDIO_CMD_SELECT_CARD;
        cmd.commandArgument                 = (uint32_t)rca;
        cmd.enableCrcCheck                  = true;
        cmd.enableAutoResponseErrorCheck    = false;
        cmd.respType                        = CY_SD_HOST_RESPONSE_LEN_48B;
        cmd.enableIdxCheck                  = true;
        cmd.dataPresent                     = false;
        cmd.cmdType                         = CY_SD_HOST_CMD_NORMAL;

        result = Cy_SD_Host_SendCommand(obj->base, &cmd);

        if (CY_SD_HOST_SUCCESS == result)
        {
            result = Cy_SD_Host_PollCmdComplete(obj->base);
        }
    }

