dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_sdhc.c
#ifndef WICED_PLATFORM_DOESNT_USE_TEMP_DMA_BUFFER
        if (( direction == CY_READ ) && ( mode == CY_SDIO_BLOCK_MODE ))
        {
            memcpy((uint32_t*)data, (const uint32_t*)temp_dma_buffer, (size_t) length );
        }
#endif

    if (response != NULL )
    {
        (void)Cy_SD_Host_GetResponse(obj->base, response, false);
    }

    if (CY_SD_HOST_SUCCESS != result)
    {
        ret = CY_RSLT_TYPE_ERROR;
    }

    return ret;
}


cy_rslt_t cy_sdio_transfer_async(cy_sdio_t *obj, cy_transfer_t direction, uint32_t argument, const uint32_t* data, uint16_t length)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    /* TODO: implement */
    return ret;
}


cy_rslt_t cy_sdio_is_busy(const cy_sdio_t *obj, bool *busy)
{
    *busy = (CY_SD_HOST_XFER_COMPLETE != (CY_SD_HOST_XFER_COMPLETE & Cy_SD_Host_GetNormalInterruptStatus(obj->base)));

    return CY_RSLT_SUCCESS;
}


cy_rslt_t cy_sdio_abort_async(const cy_sdio_t *obj)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    /* TODO: implement */
    return ret;
}


cy_rslt_t cy_sdio_register_irq(cy_sdio_t *obj, cy_sdio_irq_handler handler, void *handler_arg)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    IRQn_Type irqn = sdhc_0_interrupt_general_IRQn;
    
    if (obj->base == SDHC1)
    {
        irqn = sdhc_1_interrupt_general_IRQn;
    }
    else if (obj->base != SDHC0)
    {
        ret = CY_SYSINT_BAD_PARAM;
    }

    /* Only enable if it's not already enabled */
    if (NVIC_GetEnableIRQ(irqn) == 0)
    {
        cy_stc_sysint_t irqCfg = {irqn, SDIO_IRQ_PRIORITY};

        Cy_SysInt_Init(&irqCfg, (cy_israddress)handler);
        NVIC_EnableIRQ(irqn);
    }
    else
    {
        NVIC_SetPriority(irqn, SDIO_IRQ_PRIORITY);
    }   

    return ret;
}


cy_rslt_t cy_sdio_irq_enable(cy_sdio_t *obj, cy_sdio_irq_event_t event, bool enable)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    uint32_t interruptMask;
    uint32_t interruptEnable;

    interruptEnable = Cy_SD_Host_GetNormalInterruptEnable(obj->base);
    interruptMask = Cy_SD_Host_GetNormalInterruptMask(obj->base);

    if(enable == true) 
    {
        /* Enable specific interrupt */
        if(event < CY_SDIO_ERR_INTERRUPT)
        {
            interruptEnable |= (1 << event);
            interruptMask |= (1 << event);
        }
        /* Enable error interrupts */
        else if (event == CY_SDIO_ERR_INTERRUPT)
        {
            Cy_SD_Host_SetErrorInterruptEnable(obj->base, ENABLE_ALL_INTERRUPT_ENABLE);
            Cy_SD_Host_SetErrorInterruptMask(obj->base, ENABLE_ALL_INTERRUPT_MASK);
        }
        /* Enable all interrupts */
        else if (event == CY_SDIO_ALL_INTERRUPTS)
        {
            interruptEnable = ENABLE_ALL_INTERRUPT_ENABLE;
            interruptMask = ENABLE_ALL_INTERRUPT_MASK;
            Cy_SD_Host_SetErrorInterruptEnable(obj->base, ENABLE_ALL_INTERRUPT_ENABLE);
            Cy_SD_Host_SetErrorInterruptMask(obj->base, ENABLE_ALL_INTERRUPT_MASK);
        }
    }
    /* Disable interrupt */
    else
    {
        /* Disable specific interrupt */
        if(event < CY_SDIO_ERR_INTERRUPT)
        {
            interruptEnable &= ~(1 << event);
            interruptMask &= ~(1 << event);
        }
        /* Disable error interrupts */
        else if (event == CY_SDIO_ERR_INTERRUPT)
        {
            Cy_SD_Host_SetErrorInterruptEnable(obj->base, DISABLE_ALL_INTERRUPT_ENABLE);
            Cy_SD_Host_SetErrorInterruptMask(obj->base, DISABLE_ALL_INTERRUPT_MASK);
        }
        /* Disable all interrupts */
        else if (event == CY_SDIO_ALL_INTERRUPTS)
        {
            interruptEnable = DISABLE_ALL_INTERRUPT_ENABLE;
            interruptMask = DISABLE_ALL_INTERRUPT_MASK;
            Cy_SD_Host_SetErrorInterruptEnable(obj->base, DISABLE_ALL_INTERRUPT_ENABLE);
            Cy_SD_Host_SetErrorInterruptMask(obj->base, DISABLE_ALL_INTERRUPT_MASK);
        }
    }

    Cy_SD_Host_SetNormalInterruptMask(obj->base, interruptMask);
    Cy_SD_Host_SetNormalInterruptEnable(obj->base, interruptEnable);

    return ret;
}

#endif /* CY_IP_MXSDHC */
